import React from 'react'
import Time from './../tools/Time';
import '../../App.css';

function About() {
  return (
    <div className='flex_box'>
      <div className='flex_title'>
        <h1 className='components_title'>About Us</h1>
      </div>
      <div className='about_text'>
        <p>
          Андерсон мобайл мал эмнэлгийн үйлчилгээ нь Сан Диего, Калифорниа мужид 
          гэрийн тэжээвэр амьтантай холбоотой бүх зүйлд үйлчилж байгаадаа бахархаж 
          байна. Манай явуулын мал эмнэлгийг Сан Диего хотын малын эмч, тусгай 
          зөвшөөрөлтэй, туршлагатай доктор Натан Андерсон удирддаг.
        </p>
        <p>
          Манай хамт олон үйлчлүүлэгчдэдээ гэрийн тэжээвэр амьтдаа хэрхэн зөв 
          хооллолт, дасгал хөдөлгөөнөөр бүтэн жилийн турш эрүүл байлгах талаар 
          сургах зорилготой. Андерсон Мобайл Мал эмнэлгийн тусламж үйлчилгээ нь 
          мал эмнэлгийн технологийн хамгийн сүүлийн үеийн дэвшлээс дээгүүр байр 
          суурь эзэлдэг бөгөөд юуны түрүүнд бүх амьтан, тэжээвэр амьтдыг үзлэг, 
          мэс засал, мэс засал болгонд хайр халамжаар эмчлэх шаардлагатай гэдгийг санаж байна.
        </p>
      </div>
      <Time/>
    </div>
  )
}

export default About
