import React from 'react'
import uramshuulal from '../../image/uramshuulal.jpeg';
import uramshuulal1 from '../../image/uramshuulal1.jpeg';

function Promotion() {
  return (
    <div className='flex_box'>
      <div className='flex_title'>
        <h1>Урамшуулал</h1>
      </div>
      <div className='Promotion'>
        <h1 className='promotion_title'>УРАМШУУЛЛЫН ДЭЛГЭРЭНГҮЙ НӨХЦӨЛ</h1>
        <img src={uramshuulal} alt="" width={'100%'} />
        <div>
          <p>
            Үндэсний төлбөрийн шийдэл MonPay апликейшн болон Мобиком Корпорацийн 
            хамтарсан шинэ урамшуулал зарлагдлаа.
          </p>
          <p>
            Мобикомын Дараа болон Хосолсон төлбөрт хэрэглэгчид өөрийн үүрэн холбооны 
            үйлчилгээний төлбөрөө MonPay дансаар төлөөд, төлсөн дүнгийнхээ 10% болон 
            5%-ийн буцаан олголтыг MonPay дансандаа урамшуулал болгон аваарай. Энэхүү 
            буцаан олголтын урамшууллаа хэрэглэгч та худалдан авалт болон гүйлгээ 
            хийхдээ ашиглах боломжтой.
          </p>
          <h1>УРАМШУУЛЛЫН ДЭЛГЭРЭНГҮЙ НӨХЦӨЛ</h1>
          <p>Та төлбөрөө monpay апликейшн, эсвэл mobicom апликейшн → MonPay дансаар сар бүрийн</p>
          <ul>
            <li>5-10-ны дотор төлөхөд 10%,</li>
            <li>11-20-ны дотор төлөхөд 5%-ийн буцаан олголтыг MonPay дансандаа урамшуулал болгон авна.</li>
          </ul>
          <p>
            MonPay нь Мобифинанс ББСБ-ын хөгжүүлсэн Монголын анхны цахим мөнгөний тусгай зөвшөөрөл 
            бүхий апликейшн юм. Уг апликейшныг ашигласнаар хэрэглэгч та MonPay данс хооронд болон 
            банкны данс руу шилжүүлэг хийх, онлайн дэлгүүр, билет захиалга, даатгал, хоол, хүнс 
            хүргэлтийн үйлчилгээг гар утсаараа авч, цаг заваа хэмнэх боломжтойгоос гадна төрөл 
            бүрийн урамшуулалд хамрагдах боломжтой.
          </p>
          <img src={uramshuulal1} alt="" width={'100%'}/>
        </div>
      </div>

    </div>
  )
}

export default Promotion
