import React from 'react'
import Time from './../tools/Time';
import "../../App.css";
import serviceImage from '../../image/services_main.jpg.webp'

function Service() {
  return (
    <div className='flex_box'>
      <div className='flex_title'>
        <h1 className='components_title'>Үйлчилгээ</h1>
      </div>
      <div className='service'>
        <p>
        We are happy to provide you with a wide variety of mobile services 
        in the familiar environment of your pet’s home. Our mobile option 
        allows for a more relaxed relationship between veterinarian and 
        patient. These are the mobile services we offer for your furry companions.
        </p>
        <div>
          <h1 className='service_title'>
            Харагдсан тэжээвэр амьтдын төрлүүд
          </h1>
          <p>
            At Anderson Mobile Veterinary Care, we can care for many types of pets:
          </p>
          <ul>
            <li>Dogs</li>
            <li>Cats</li>
            <li>Rabbits</li>
            <li>Guinea Pigs</li>
            <li>Rats</li> 
            <li>Hamsters</li>
          </ul>
        </div>
        <div>
          <h1 className='service_title'>
            Бид Anderson Mobile Veterinary Care-д дараах үйлчилгээг санал болгож байгаадаа таатай байна.
          </h1>
          <div className='serviceImage'>
            <div>
              <h1 className='service_title'>
                Шалгалт
              </h1>
              <p>
                Стандарт үзлэгт гэрийн тэжээмэл амьтдынхаа температурыг хэмжих, чих, нүд, зүрхний 
                цохилт, шүд, эрхтэн, биеийн температурыг шалгах зэрэг орно. Бид таны санаа зовоосон 
                асуудлын талаар ярилцаж, хоолны дэглэм, дасгал хөдөлгөөн, амьдралын хэв маягаар 
                дамжуулан гэрийн тэжээвэр амьтдынхаа эрүүл мэндийг сайжруулах арга замыг санал болгоно.
              </p>
              <p>
                Жил бүрийн эрүүл мэндийн үзлэгийг товлосноор бид хамтдаа олон өвчнөөс урьдчилан 
                сэргийлэх боломжтой. Хэрэв өвчин илэрвэл эрт илрүүлэх нь таны тэжээвэр амьтдыг 
                бүрэн эдгэрэх хамгийн сайн боломж юм.
              </p>
              <h1 className='service_title'>
                Вакцинжуулалт
              </h1>
              <p>
                Муур, нохойгоо тогтмол вакцинжуулалтын хуваарьтай байлгах нь тэдний эрүүл мэндийг 
                хамгаалж, мөн ойр орчмынхоо бусад нохой, муур, хүмүүсийн эрүүл мэндийг хамгаалдаг. 
                Бид танай гэрт бүх стандартын вакциныг хүргэж өгөх боломжтой.
              </p>
            </div>
            <div className='service_image'>
              <img src={serviceImage} alt="image"/>
            </div>
          </div>
        </div>
        {serviceData.map((item, index)=>{
          return(
            <div key={index}>
              <h1 className='service_title'>{item.title}</h1>
              <p>{item.text}</p>
            </div>
          )
        })}

      </div>
      <Time/>
    </div>
  )
}

const serviceData = [
  {
    title: 'Оношлогооны тестүүд',
    text: 'Бид суурь дүгнэлт гаргах, асуудлыг оношлох, ахмад тэжээвэр амьтдын сайн сайхан байдлыг хянах зорилгоор цусны шинжилгээ хийдэг. Бид мал эмнэлгийн лабораторитой хамтран ажилладаг бөгөөд лаборатори нь бидний авсан дээжийг шинжлэх болно. Шаардлагатай бол рентген болон хэт авиан шинжилгээг газар дээр нь хийж болно.',
  },
  {
    title: 'Туулгалт',
    text: 'Ихэнх тэжээвэр амьтад, ялангуяа гадаа цагийг өнгөрөөдөг хүмүүс үе үе хорхойн өвчин үүсгэдэг. Бид таны муур, нохойг туулгах зорилгоор аман эм хэрэглэдэг.',
  },
  {
    title: 'Гэрийн эмнэлгийн тусламж үйлчилгээ',
    text: 'Хэрэв таны муур, нохой мэдэгдэж буй өвчин, эмгэгээр өвчилсөн бол малын эмч рүү явахгүй байхыг илүүд үзэж болно. Бид тэднийг гэртээ хамгийн тухтай байгаа газарт нь ирж эмчилж байгаадаа баяртай байна.',
  },
  {
    title: 'Амьдралын төгсгөлийн тусламж',
    text: 'Хэрэв таны гэрийн тэжээмэл амьтан маш хөгшин эсвэл эдгэршгүй өвчтэй бол түүнийг аль болох тав тухтай, өвдөлтгүй байлгахыг хүсч байна. Тийм ч учраас бид хөнгөвчлөх тусламж үйлчилгээ үзүүлэх, амьдралын чанарыг үнэлэх, хэрэв баяртай гэж хэлэх цаг нь болсон бол гэрийн тэжээвэр амьтдаа хүнлэг байдлаар үхүүлэх зорилгоор таны гэрт ирдэг.',
  },
  {
    title: 'Яаралтай, яаралтай тусламж',
    text: 'Бид таны тэжээвэр амьтдад яаралтай тусламж үзүүлэхэд бэлтгэгдсэн, бэлтгэгдсэн малын эмч, долоо хоногийн зургаан өдөр жижүүрийн ажилтнуудтай. Ихэвчлэн яаралтай тусламжийн баг нь тэжээвэр амьтдын амийг аврахын тулд дор хаяж нэг малын эмч, хэд хэдэн техникчээс бүрддэг. Яаралтай байдал нь хархны хорыг санамсаргүйгээр залгих, машинд мөргүүлэх, шоколад залгих зэрэг байж болно. Хэрэв та гэрийн тэжээвэр амьтандаа яаралтай тусламж үзүүлэх шаардлагатай гэж үзвэл тэр даруйд нь залгахаас бүү эргэлз.',
  },
  {
    title: '',
    text: 'Мөн амь насанд аюул занал учруулахгүй тохиолдолд яаралтай тусламж үзүүлэх боломжтой. Хэрэв та гэрийн тэжээвэр амьтдыг цаг авахаас өмнө үзүүлэх шаардлагатай гэж үзвэл бид таныг товлосон уулзалтын хооронд оруулахын тулд ажиллах болно. Таныг дуудах үед бид эмч тантай уулзах хүртэл хэр удаан хүлээх шаардлагатайг тооцоолж өгөх боломжтой.'
  },
  {
    title: 'Лавлах үйлчилгээ',
    text: 'Хэрэв бид шалгалтын явцад гар утасны үйлчилгээгээр шийдвэрлэх боломжгүй асуудлыг илрүүлбэл тухайн хэсгийн мэргэжилтнүүдийг санал болгож болно. Шаардлагатай бол бид тэжээвэр амьтдаа тээвэрлэх ажлыг зохион байгуулахад тусалж чадна.',
  },
  {
    title: ' ',
    text:'Хэрэв та нохой, мууранд явуулын мал эмнэлгийн үйлчилгээ хамгийн сайн сонголт гэж бодож байвал бидэнтэй 800-462-8749 дугаарын утсаар холбогдож цаг товлох боломжтой.'
  },
]

export default Service
